Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendArcLength.#ctor(Autodesk.Revit.DB.ElementId)
Create a 180-degree bend constraint driven by arc length.
paramId:
The Id of a Rebar Shape parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendArcLength
A constraint which can be applied to a RebarShapeSegment, and causes the segment
to be replaced with a 180-degree arc. The associated parameter drives
the arc length.
Since:
2012